In [1]:
import pandas as pd

data_url = 'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Salaries.csv'
df = pd.read_csv(data_url, index_col=0)

df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [6]:
# Populate custom INFO table
compactInfoView = pd.DataFrame()
compactInfoView['Total Values'] = df.count()
compactInfoView['Unique Values'] = df.nunique()
compactInfoView['Null Values'] = df.isna().sum()
compactInfoView['Data Type'] = df.dtypes
display (compactInfoView)

df.info()

               Total Values  Unique Values  Null Values Data Type
rank                    397              3            0    object
discipline              397              2            0    object
yrs.since.phd           397             53            0     int64
yrs.service             397             52            0     int64
sex                     397              2            0    object
salary                  397            371            0     int64

<class 'pandas.core.frame.DataFrame'>
Int64Index: 397 entries, 1 to 397
Data columns (total 6 columns):
rank             397 non-null object
discipline       397 non-null object
yrs.since.phd    397 non-null int64
yrs.service      397 non-null int64
sex              397 non-null object
salary           397 non-null int64
dtypes: int64(3), object(3)
memory usage: 17.1+ KB